ir_version: 6
producer_name: "pytorch"
producer_version: "2.0.1"
model_version: 0
graph {
  name: "torch_jit"
  node {
    input: "images"
    input: "/backbone/backbone/stem/Constant_1_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_output_0"
    name: "/backbone/backbone/stem/Slice"
    op_type: "Slice"
  }
  node {
    input: "/backbone/backbone/stem/Slice_output_0"
    input: "/backbone/backbone/stem/Constant_1_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_4_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_1_output_0"
    name: "/backbone/backbone/stem/Slice_1"
    op_type: "Slice"
  }
  node {
    input: "/backbone/backbone/stem/Slice_output_0"
    input: "/backbone/backbone/stem/Constant_9_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_4_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_2_output_0"
    name: "/backbone/backbone/stem/Slice_2"
    op_type: "Slice"
  }
  node {
    input: "images"
    input: "/backbone/backbone/stem/Constant_9_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_3_output_0"
    name: "/backbone/backbone/stem/Slice_3"
    op_type: "Slice"
  }
  node {
    input: "/backbone/backbone/stem/Slice_3_output_0"
    input: "/backbone/backbone/stem/Constant_1_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_4_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_4_output_0"
    name: "/backbone/backbone/stem/Slice_4"
    op_type: "Slice"
  }
  node {
    input: "/backbone/backbone/stem/Slice_3_output_0"
    input: "/backbone/backbone/stem/Constant_9_output_0"
    input: "/backbone/backbone/stem/Constant_2_output_0"
    input: "/backbone/backbone/stem/Constant_4_output_0"
    input: "/backbone/backbone/stem/Constant_output_0"
    output: "/backbone/backbone/stem/Slice_5_output_0"
    name: "/backbone/backbone/stem/Slice_5"
    op_type: "Slice"
  }
  node {
    input: "/backbone/backbone/stem/Slice_1_output_0"
    input: "/backbone/backbone/stem/Slice_4_output_0"
    input: "/backbone/backbone/stem/Slice_2_output_0"
    input: "/backbone/backbone/stem/Slice_5_output_0"
    output: "/backbone/backbone/stem/Concat_output_0"
    name: "/backbone/backbone/stem/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/backbone/backbone/stem/Concat_output_0"
    input: "onnx::Conv_868"
    input: "onnx::Conv_869"
    output: "/backbone/backbone/stem/conv/conv/Conv_output_0"
    name: "/backbone/backbone/stem/conv/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/stem/conv/conv/Conv_output_0"
    output: "/backbone/backbone/stem/conv/act/Sigmoid_output_0"
    name: "/backbone/backbone/stem/conv/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/stem/conv/conv/Conv_output_0"
    input: "/backbone/backbone/stem/conv/act/Sigmoid_output_0"
    output: "/backbone/backbone/stem/conv/act/Mul_output_0"
    name: "/backbone/backbone/stem/conv/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/stem/conv/act/Mul_output_0"
    input: "onnx::Conv_871"
    input: "onnx::Conv_872"
    output: "/backbone/backbone/dark2/dark2.0/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.0/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.0/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.0/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.0/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.0/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.0/act/Mul_output_0"
    input: "onnx::Conv_874"
    input: "onnx::Conv_875"
    output: "/backbone/backbone/dark2/dark2.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.0/act/Mul_output_0"
    input: "onnx::Conv_877"
    input: "onnx::Conv_878"
    output: "/backbone/backbone/dark2/dark2.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv1/act/Mul_output_0"
    input: "onnx::Conv_880"
    input: "onnx::Conv_881"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv1/act/Mul_output_0"
    input: "onnx::Conv_883"
    input: "onnx::Conv_884"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark2/dark2.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark2/dark2.1/m/m.0/Add_output_0"
    name: "/backbone/backbone/dark2/dark2.1/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/m/m.0/Add_output_0"
    input: "/backbone/backbone/dark2/dark2.1/conv2/act/Mul_output_0"
    output: "/backbone/backbone/dark2/dark2.1/Concat_output_0"
    name: "/backbone/backbone/dark2/dark2.1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/Concat_output_0"
    input: "onnx::Conv_886"
    input: "onnx::Conv_887"
    output: "/backbone/backbone/dark2/dark2.1/conv3/conv/Conv_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv3/conv/Conv_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv3/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv3/conv/Conv_output_0"
    input: "/backbone/backbone/dark2/dark2.1/conv3/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark2/dark2.1/conv3/act/Mul_output_0"
    name: "/backbone/backbone/dark2/dark2.1/conv3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark2/dark2.1/conv3/act/Mul_output_0"
    input: "onnx::Conv_889"
    input: "onnx::Conv_890"
    output: "/backbone/backbone/dark3/dark3.0/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.0/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.0/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.0/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.0/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.0/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.0/act/Mul_output_0"
    input: "onnx::Conv_892"
    input: "onnx::Conv_893"
    output: "/backbone/backbone/dark3/dark3.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.0/act/Mul_output_0"
    input: "onnx::Conv_895"
    input: "onnx::Conv_896"
    output: "/backbone/backbone/dark3/dark3.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv1/act/Mul_output_0"
    input: "onnx::Conv_898"
    input: "onnx::Conv_899"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv1/act/Mul_output_0"
    input: "onnx::Conv_901"
    input: "onnx::Conv_902"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark3/dark3.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.0/Add_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/Add_output_0"
    input: "onnx::Conv_904"
    input: "onnx::Conv_905"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv1/act/Mul_output_0"
    input: "onnx::Conv_907"
    input: "onnx::Conv_908"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.0/Add_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.1/Add_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.1/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/Add_output_0"
    input: "onnx::Conv_910"
    input: "onnx::Conv_911"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv1/act/Mul_output_0"
    input: "onnx::Conv_913"
    input: "onnx::Conv_914"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark3/dark3.1/m/m.1/Add_output_0"
    output: "/backbone/backbone/dark3/dark3.1/m/m.2/Add_output_0"
    name: "/backbone/backbone/dark3/dark3.1/m/m.2/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/m/m.2/Add_output_0"
    input: "/backbone/backbone/dark3/dark3.1/conv2/act/Mul_output_0"
    output: "/backbone/backbone/dark3/dark3.1/Concat_output_0"
    name: "/backbone/backbone/dark3/dark3.1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/Concat_output_0"
    input: "onnx::Conv_916"
    input: "onnx::Conv_917"
    output: "/backbone/backbone/dark3/dark3.1/conv3/conv/Conv_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv3/conv/Conv_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv3/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv3/conv/Conv_output_0"
    input: "/backbone/backbone/dark3/dark3.1/conv3/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark3/dark3.1/conv3/act/Mul_output_0"
    name: "/backbone/backbone/dark3/dark3.1/conv3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark3/dark3.1/conv3/act/Mul_output_0"
    input: "onnx::Conv_919"
    input: "onnx::Conv_920"
    output: "/backbone/backbone/dark4/dark4.0/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.0/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.0/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.0/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.0/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.0/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.0/act/Mul_output_0"
    input: "onnx::Conv_922"
    input: "onnx::Conv_923"
    output: "/backbone/backbone/dark4/dark4.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.0/act/Mul_output_0"
    input: "onnx::Conv_925"
    input: "onnx::Conv_926"
    output: "/backbone/backbone/dark4/dark4.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv1/act/Mul_output_0"
    input: "onnx::Conv_928"
    input: "onnx::Conv_929"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv1/act/Mul_output_0"
    input: "onnx::Conv_931"
    input: "onnx::Conv_932"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark4/dark4.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.0/Add_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/Add_output_0"
    input: "onnx::Conv_934"
    input: "onnx::Conv_935"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv1/act/Mul_output_0"
    input: "onnx::Conv_937"
    input: "onnx::Conv_938"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.0/Add_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.1/Add_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.1/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/Add_output_0"
    input: "onnx::Conv_940"
    input: "onnx::Conv_941"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv1/act/Mul_output_0"
    input: "onnx::Conv_943"
    input: "onnx::Conv_944"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/conv2/act/Mul_output_0"
    input: "/backbone/backbone/dark4/dark4.1/m/m.1/Add_output_0"
    output: "/backbone/backbone/dark4/dark4.1/m/m.2/Add_output_0"
    name: "/backbone/backbone/dark4/dark4.1/m/m.2/Add"
    op_type: "Add"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/m/m.2/Add_output_0"
    input: "/backbone/backbone/dark4/dark4.1/conv2/act/Mul_output_0"
    output: "/backbone/backbone/dark4/dark4.1/Concat_output_0"
    name: "/backbone/backbone/dark4/dark4.1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/Concat_output_0"
    input: "onnx::Conv_946"
    input: "onnx::Conv_947"
    output: "/backbone/backbone/dark4/dark4.1/conv3/conv/Conv_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv3/conv/Conv_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv3/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv3/conv/Conv_output_0"
    input: "/backbone/backbone/dark4/dark4.1/conv3/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark4/dark4.1/conv3/act/Mul_output_0"
    name: "/backbone/backbone/dark4/dark4.1/conv3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark4/dark4.1/conv3/act/Mul_output_0"
    input: "onnx::Conv_949"
    input: "onnx::Conv_950"
    output: "/backbone/backbone/dark5/dark5.0/conv/Conv_output_0"
    name: "/backbone/backbone/dark5/dark5.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.0/conv/Conv_output_0"
    output: "/backbone/backbone/dark5/dark5.0/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark5/dark5.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.0/conv/Conv_output_0"
    input: "/backbone/backbone/dark5/dark5.0/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark5/dark5.0/act/Mul_output_0"
    name: "/backbone/backbone/dark5/dark5.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.0/act/Mul_output_0"
    input: "onnx::Conv_952"
    input: "onnx::Conv_953"
    output: "/backbone/backbone/dark5/dark5.1/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark5/dark5.1/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark5/dark5.1/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark5/dark5.1/m.0/MaxPool_output_0"
    name: "/backbone/backbone/dark5/dark5.1/m.0/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark5/dark5.1/m.1/MaxPool_output_0"
    name: "/backbone/backbone/dark5/dark5.1/m.1/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 9
      ints: 9
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 4
      ints: 4
      ints: 4
      ints: 4
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul_output_0"
    output: "/backbone/backbone/dark5/dark5.1/m.2/MaxPool_output_0"
    name: "/backbone/backbone/dark5/dark5.1/m.2/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 13
      ints: 13
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 6
      ints: 6
      ints: 6
      ints: 6
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv1/act/Mul_output_0"
    input: "/backbone/backbone/dark5/dark5.1/m.0/MaxPool_output_0"
    input: "/backbone/backbone/dark5/dark5.1/m.1/MaxPool_output_0"
    input: "/backbone/backbone/dark5/dark5.1/m.2/MaxPool_output_0"
    output: "/backbone/backbone/dark5/dark5.1/Concat_output_0"
    name: "/backbone/backbone/dark5/dark5.1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/Concat_output_0"
    input: "onnx::Conv_955"
    input: "onnx::Conv_956"
    output: "/backbone/backbone/dark5/dark5.1/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark5/dark5.1/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv2/conv/Conv_output_0"
    input: "/backbone/backbone/dark5/dark5.1/conv2/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark5/dark5.1/conv2/act/Mul_output_0"
    name: "/backbone/backbone/dark5/dark5.1/conv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv2/act/Mul_output_0"
    input: "onnx::Conv_958"
    input: "onnx::Conv_959"
    output: "/backbone/backbone/dark5/dark5.2/conv1/conv/Conv_output_0"
    name: "/backbone/backbone/dark5/dark5.2/conv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.2/conv1/conv/Conv_output_0"
    output: "/backbone/backbone/dark5/dark5.2/conv1/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark5/dark5.2/conv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.2/conv1/conv/Conv_output_0"
    input: "/backbone/backbone/dark5/dark5.2/conv1/act/Sigmoid_output_0"
    output: "/backbone/backbone/dark5/dark5.2/conv1/act/Mul_output_0"
    name: "/backbone/backbone/dark5/dark5.2/conv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.1/conv2/act/Mul_output_0"
    input: "onnx::Conv_961"
    input: "onnx::Conv_962"
    output: "/backbone/backbone/dark5/dark5.2/conv2/conv/Conv_output_0"
    name: "/backbone/backbone/dark5/dark5.2/conv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/backbone/backbone/dark5/dark5.2/conv2/conv/Conv_output_0"
    output: "/backbone/backbone/dark5/dark5.2/conv2/act/Sigmoid_output_0"
    name: "/backbone/backbone/dark5/dark5.2/conv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/backbone/backbone/dark5/dark5.2/conv2/conv/Conv_output_0"
